OpenDTEF-v2012/tutorials/incompressible/pimpleFoam/laminar/mixerVesselAMI2D/mixerVesselAMI2D-topologyChange/Allrun
#!/bin/sh
cd "${0%/*}" || exit                                # Run from this directory
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions        # Tutorial run functions
#------------------------------------------------------------------------------

./makeMesh

#runApplication $(getApplication)
runApplication decomposePar
runParallel $(getApplication)
runParallel redistributePar -reconstruct

#------------------------------------------------------------------------------
